---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchFailure
source: html/1d3141f6-ad2d-a0da-0f8a-192aa584228a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.VarSketchFailure Property

Constraints defined by highlighted Lines and Dimensions can't be satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId VarSketchFailure { get; }
```